---
type: MEPCalculationServerInfo
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# MEPCalculationServerInfo

`Autodesk.Revit.DB.MEPCalculationServerInfo` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MEPCalculationServerInfo | — | `` |
| Constructor | MEPCalculationServerInfo | — | `public MEPCalculationServerInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetMEPCalculationServerInfo | — | `public static MEPCalculationServerInfo GetMEPCalculationServerInfo ( FamilyInstance famInst )` |
| Property | Description | — | `public string Description { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PipeUseDefinitionOnTypeGUID | — | `public static Guid PipeUseDefinitionOnTypeGUID { get ; }` |
| Property | ServerId | — | `public Guid ServerId { get ; set ; }` |
| Property | ServerName | — | `public string ServerName { get ; set ; }` |